MinoruInachi/tulipcc/tulip/esp32p4/boards/TAB5/display_tab5.c
#include <stdint.h>
#include <stdio.h>
#include <stdbool.h>
#include <stdlib.h>
#include <string.h>

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/semphr.h"
#include "esp_timer.h"
#include "esp_log.h"

#include "esp_lcd_panel_ops.h"
#include "esp_lcd_mipi_dsi.h"
#include "esp_lcd_st7121.h"
#include "esp_ldo_regulator.h"
#include "esp_check.h"
#include "esp_heap_caps.h"
#include "driver/ppa.h"
#include "bsp/esp-bsp.h"
#include "bsp/m5stack_tab5.h"
#include "lvgl.h"

#include "display_tab5.h"
#include "pie_blend_tab5.h"
#include "pins.h"
#include "tab5_revision.h"

static const char *TAG = "TAB5-DISPLAY";

#define TAB5_BRIDGE_CHUNK_ROWS 12
#define TAB5_SHARED_RENDER_W 1280
#define TAB5_SHARED_RENDER_H 720
/* L1 and L2 lines are both 64B on this target (CONFIG_CACHE_*_CACHE_LINE_64B). */
#define TAB5_CACHE_LINE_BYTES 64
#define TAB5_REPL_TRANSPARENT_BG 0x55
/* Set to 1 for bring-up testing to force rotated provider path using scaffold data. */
#define TAB5_FORCE_ROTATED_PROVIDER_TEST 0

static uint32_t s_bridge_frame_id = 0;
static bool s_tulip_shared_renderer_initialized = false;

/* Shared-provider symbols are provided by TAB5 bring-up provider today and
 * will later be replaced by the full Tulip shared renderer implementation. */
extern bool display_bounce_empty(void *bounce_buf, int pos_px, int len_bytes, void *user_ctx);
extern bool display_frame_done_generic(void);
extern uint8_t brightness;
extern void display_init(void);
extern void display_set_bg_pixel_pal(uint16_t x, uint16_t y, uint8_t pal_idx);
extern void display_tfb_set_default_bg_color(uint8_t color);
extern int16_t lvgl_is_repl;
/* Shared Tulip stats, read back by tulip.fps() / tulip.gpu(). */
extern float reported_fps;
extern float reported_gpu_usage;
extern uint8_t gpu_log;
/* Set by anything that changes the framebuffer contents; see shared/display.c. */
extern volatile uint8_t display_dirty;
extern bool display_take_dirty_rows(int *y0, int *y1);
extern void display_mark_dirty_rows(int y0, int y1);

bool tab5_repl_menu_icon_touch_event(int16_t shared_x, int16_t shared_y, bool up)
{
    (void)shared_x;
    (void)shared_y;
    (void)up;
    return false;
}

static void tab5_clear_boot_background(void)
{
    // Fill with a stable solid tone to avoid test-pattern artifacts.
    for (uint16_t y = 0; y < BSP_LCD_V_RES; y++) {
        for (uint16_t x = 0; x < BSP_LCD_H_RES; x++) {
            (void)x;
            display_set_bg_pixel_pal(x, y, 9);
        }
    }
}

static bool tab5_scaffold_bounce_empty(void *bounce_buf, int pos_px, int len_bytes, void *user_ctx)
{
    (void)user_ctx;

    if (bounce_buf == NULL || len_bytes <= 0) {
        return false;
    }

    uint16_t *out = (uint16_t *)bounce_buf;
    const int row0 = pos_px / BSP_LCD_H_RES;
    const int rows = len_bytes / (BSP_LCD_H_RES * (int)sizeof(uint16_t));

    for (int r = 0; r < rows; r++) {
        const int y = row0 + r;
        for (int x = 0; x < BSP_LCD_H_RES; x++) {
            /* Eight red bars, a blue ramp scrolling down them: RGB565. */
            const uint16_t bar = (uint16_t)((x * 8) / BSP_LCD_H_RES);
            const uint16_t anim = (uint16_t)((y + (int)(s_bridge_frame_id & 0x1f)) & 0x1f);
            out[r * BSP_LCD_H_RES + x] = (uint16_t)((bar << 13) | anim);
        }
    }

    return true;
}

static bool tab5_scaffold_frame_done(void)
{
    s_bridge_frame_id++;
    return true;
}

static void tab5_render_bridge_buffers_deinit(void);

static tab5_render_bounce_empty_fn_t s_render_bounce_empty = tab5_scaffold_bounce_empty;
static tab5_render_frame_done_fn_t s_render_frame_done = tab5_scaffold_frame_done;
/* Composed rows, RGB565 -- the compositor's own format now that the BG plane
 * is 16-bit, so nothing is converted between it and the panel.
 *
 * Two chunks, ping-ponged: the PPA rotates one straight out of internal SRAM
 * while the compositor fills the other. That is what removed the full-screen
 * landscape staging image this used to compose into. The staging image existed
 * only so the PPA had a full-frame source to read a band out of, and it cost
 * 1.84 MB of PSRAM writes plus the ~28 ms memcpy that made them, every frame.
 * The PPA is happy to read a 1280xN strip out of internal RAM instead (see
 * ppa_srm.c: "in_buffer could be anywhere"), and its driver write-backs that
 * strip for us -- which is necessary rather than merely convenient, because
 * internal RAM is cached through L1 on this chip
 * (SOC_CACHE_INTERNAL_MEM_VIA_L1CACHE).
 *
 * Two buffers is the minimum that is safe with one transaction in flight: by
 * the time chunk i is composed into a buffer, the transaction that last used
 * that buffer (i-2) was already waited for, before i-1 was issued. */
#define TAB5_CHUNK_BUFFERS 2
static uint16_t *s_chunk565[TAB5_CHUNK_BUFFERS] = {NULL, NULL};
static uint8_t s_chunk_next = 0;
static int s_linebuf_width = 0;
/* The rotation in flight, if any, and the strip it is reading -- so a timeout
 * can redo exactly that strip on the CPU, out of the buffer that still holds
 * it. */
static bool s_ppa_pending = false;
static const uint16_t *s_pending_src = NULL;
static void *s_pending_fb = NULL;
static int s_pending_y = 0;
static int s_pending_rows = 0;

/* Hardware rotation. The ESP32-P4 PPA does scale/rotate/mirror in a DMA engine,
 * so the CPU never touches the portrait framebuffer. */
static ppa_client_handle_t s_ppa_srm = NULL;
static void *s_dsi_fb[2] = {NULL, NULL};
static uint8_t s_dsi_fb_count = 0;
static uint8_t s_dsi_fb_next = 0;
static uint32_t s_ppa_failures = 0;
/* The PPA transaction is issued non-blocking and waited for here, with a
 * timeout. In blocking mode the driver waits on the DMA2D completion forever,
 * and a completion that never arrives took the whole display task with it:
 * the screen froze while everything else kept running, and nothing could say
 * why because the task was parked inside the driver. A timeout turns that
 * into one slow frame, a counter and a log line. */
static SemaphoreHandle_t s_ppa_done_sem = NULL;
static uint32_t s_ppa_timeouts = 0;
static volatile uint8_t s_phase = TAB5_PHASE_WAIT_VSYNC;
#define TAB5_PPA_TIMEOUT_MS 250
/* Recovery after a timeout. The transaction that never finished still holds
 * the client's one pending slot, and ppa_unregister_client() refuses a
 * client with unprocessed transactions, so the client is abandoned (a few
 * hundred bytes) and a fresh one opened. Measured with the camera app: one
 * rotation out of tens of thousands stalls, some minutes in, and the next
 * client carries on at full speed. After this many the PPA is left alone
 * and rotation stays on the CPU. */
#define TAB5_PPA_MAX_RECOVERIES 3
static uint32_t s_ppa_recoveries = 0;
static int s_ppa_last_err = 0;
static int s_ppa_stuck_y = -1, s_ppa_stuck_rows = 0, s_ppa_last_y = -1, s_ppa_last_rows = 0;
/* A frame that ran this long without blocking hands the core to IDLE0 for a
 * tick before waiting for vsync, or the idle-task watchdog fires on core 0
 * (its check is deliberately on, see sdkconfig.board). Only the CPU rotation
 * fallback gets near it. */
#define TAB5_FRAME_YIELD_US 50000

/* Per-frame phase timings, in microseconds, for the last completed frame.
 * Surfaced through tulip.tab5_render_stats() so the cost of a change can be
 * attributed instead of guessed at. */
static uint32_t s_us_composite = 0;   /* Tulip compositor callbacks */
static uint32_t s_us_convert = 0;     /* blocked on the PPA: the rotation the pipeline could not hide */
static uint32_t s_us_rotate = 0;      /* CPU rotation, when the PPA was unavailable or timed out */
/* The frame in progress accumulates into these, and they are published into the
 * three above only once it is finished. tulip.tab5_render_stats() reads from
 * another task, so reading the accumulators directly caught them part-built:
 * the composite figure swung between 4ms and 39ms for the same workload, which
 * is useless for deciding what to optimise. */
static uint32_t s_acc_composite = 0;
static uint32_t s_acc_convert = 0;
static uint32_t s_acc_rotate = 0;
static uint32_t s_us_present = 0;     /* draw_bitmap: cache write-back + fb swap */
static uint32_t s_us_wait = 0;        /* blocked waiting for the panel */
static uint32_t s_frames_skipped = 0; /* frames dropped because nothing changed */
static uint32_t s_band_rows = 0;      /* rows recomposed for the last frame */

