MinoruInachi/tulipcc/tulip/esp32p4/boards/TAB5/display_tab5.c
/* Damage presented into the other DSI framebuffer last frame. */
static int s_prev_band_y0 = 0;
static int s_prev_band_y1 = TAB5_SHARED_RENDER_H;

/* Panel refresh signal, so the loop paces to the display instead of a fixed
 * vTaskDelay stacked on top of however long the frame happened to take. */
static SemaphoreHandle_t s_vsync_sem = NULL;
/* Redraw the panel even when nothing reported a change, so a missed
 * display_mark_dirty() shows up as a stale second rather than a frozen screen --
 * but a slice of it at a time. The display task is serial, so redrawing the
 * whole screen in one go parks every damage band behind it. That mattered a
 * great deal when a full frame cost ~130ms of composite + convert + rotate:
 * drums.py's beat LEDs stopped following the sequencer for a third of a step,
 * several times a bar. A full frame is ~20ms now that the staging copy is gone
 * and the rotation runs behind the compositing, so the stall is much smaller,
 * but slicing still costs nothing and keeps the worst case off the damage
 * path: eight slices, one every four frames, cover the screen in ~0.9s. */
#define TAB5_FORCED_SLICE_FRAMES 4
#define TAB5_FORCED_SLICES 8
#define TAB5_FORCED_SLICE_ROWS ((TAB5_SHARED_RENDER_H + TAB5_FORCED_SLICES - 1) / TAB5_FORCED_SLICES)
/* A slice waits for a frame that has no damage of its own (see below). If every
 * frame has some, it cannot wait for ever. */
#define TAB5_FORCED_SLICE_MAX_FRAMES (TAB5_FORCED_SLICE_FRAMES * 8)
static int s_provider_width = BSP_LCD_H_RES;
static int s_provider_height = BSP_LCD_V_RES;
static bool s_shared_provider_active = false;
static uint32_t s_bridge_frames = 0;
static volatile uint32_t s_display_task_entries = 0;
static uint32_t s_bridge_fallbacks = 0;
static uint32_t s_native_callback_failures = 0;
static uint32_t s_rotated_callback_failures = 0;
static int64_t s_last_stats_log_us = 0;
static uint32_t s_last_stats_frames = 0;
static int64_t s_window_busy_us = 0;

/* Refresh the numbers behind tulip.fps() / tulip.gpu().
 *
 * The esp32s3 port averages over a fixed 100 frames, which is unusable here:
 * at the rates this bridge runs that would be a 25-second window. Average over
 * a 1-second wall-clock window instead, and report GPU usage as the fraction of
 * that window actually spent inside the render tick. */
#define TAB5_STATS_WINDOW_US 1000000

static void tab5_bridge_update_stats(void)
{
    const int64_t now_us = esp_timer_get_time();
    if (s_last_stats_log_us == 0) {
        s_last_stats_log_us = now_us;
        s_last_stats_frames = s_bridge_frames;
        s_window_busy_us = 0;
        return;
    }

    const int64_t elapsed_us = now_us - s_last_stats_log_us;
    if (elapsed_us < TAB5_STATS_WINDOW_US) {
        return;
    }

    const uint32_t window_frames = s_bridge_frames - s_last_stats_frames;
    const float window_fps = (float)window_frames * 1000000.0f / (float)elapsed_us;

    reported_fps = window_fps;
    reported_gpu_usage = (float)s_window_busy_us * 100.0f / (float)elapsed_us;
    if (reported_gpu_usage > 100.0f) {
        reported_gpu_usage = 100.0f;
    }

    s_last_stats_log_us = now_us;
    s_last_stats_frames = s_bridge_frames;
    s_window_busy_us = 0;

    /* Same one-shot semantics as the esp32s3 port: tulip.gpu_reset() arms it. */
    if (!gpu_log) {
        return;
    }
    gpu_log = 0;
    ESP_LOGI(TAG,
             "bridge stats: frames=%lu window_fps=%.2f fallbacks=%lu native_fail=%lu rotated_fail=%lu provider=%s (%dx%d)",
             (unsigned long)s_bridge_frames,
             window_fps,
             (unsigned long)s_bridge_fallbacks,
             (unsigned long)s_native_callback_failures,
             (unsigned long)s_rotated_callback_failures,
             s_shared_provider_active ? "shared" : "scaffold",
             s_provider_width,
             s_provider_height);
}

static void tab5_use_scaffold_provider(const char *reason)
{
    tab5_set_render_provider_with_geometry(tab5_scaffold_bounce_empty,
                                           tab5_scaffold_frame_done,
                                           BSP_LCD_H_RES,
                                           BSP_LCD_V_RES);
    s_shared_provider_active = false;
    s_bridge_fallbacks++;
    if (reason != NULL) {
        ESP_LOGW(TAG, "Falling back to scaffold render provider: %s", reason);
    }
}

void tab5_set_render_provider(tab5_render_bounce_empty_fn_t bounce_empty_cb,
                              tab5_render_frame_done_fn_t frame_done_cb)
{
    tab5_set_render_provider_with_geometry(bounce_empty_cb, frame_done_cb, BSP_LCD_H_RES, BSP_LCD_V_RES);
}

void tab5_set_render_provider_with_geometry(tab5_render_bounce_empty_fn_t bounce_empty_cb,
                                            tab5_render_frame_done_fn_t frame_done_cb,
                                            int provider_width,
                                            int provider_height)
{
    if (bounce_empty_cb != NULL) {
        s_render_bounce_empty = bounce_empty_cb;
    }
    if (frame_done_cb != NULL) {
        s_render_frame_done = frame_done_cb;
    }

    if (provider_width > 0) {
        s_provider_width = provider_width;
    }
    if (provider_height > 0) {
        s_provider_height = provider_height;
    }
}

static bool tab5_render_bridge_buffers_init(void)
{
    const size_t chunk_px = (size_t)s_provider_width * TAB5_BRIDGE_CHUNK_ROWS;

    if (s_chunk565[0] != NULL && s_linebuf_width == s_provider_width) {
        return true;
    }
    tab5_render_bridge_buffers_deinit();

    /* Internal SRAM, because the compositor touches these per pixel and the
     * PPA then reads them as DMA; cache-line aligned so the driver's write-back
     * of the strip stays cheap. The second buffer is what lets one strip rotate
     * while the next is composed, so losing it costs speed but not
     * correctness -- carry on with one and say so. */
    for (int i = 0; i < TAB5_CHUNK_BUFFERS; i++) {
        s_chunk565[i] = heap_caps_aligned_alloc(TAB5_CACHE_LINE_BYTES,
                                                chunk_px * sizeof(uint16_t),
                                                MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
    }
    if (s_chunk565[0] == NULL) {
        s_chunk565[0] = heap_caps_aligned_alloc(TAB5_CACHE_LINE_BYTES,
                                                chunk_px * sizeof(uint16_t),
                                                MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    }
    if (s_chunk565[0] == NULL) {
        s_linebuf_width = 0;
        ESP_LOGE(TAG, "No memory for render bridge buffers");
        return false;
    }
    if (s_chunk565[1] == NULL) {
        ESP_LOGW(TAG, "Only one render chunk buffer; rotation will not overlap compositing");
    }
    s_chunk_next = 0;
    s_linebuf_width = s_provider_width;

