MinoruInachi/tulipcc/tulip/esp32p4/boards/TAB5/display_tab5.c
    return true;
}

static void tab5_render_bridge_buffers_deinit(void)
{
    for (int i = 0; i < TAB5_CHUNK_BUFFERS; i++) {
        heap_caps_free(s_chunk565[i]);
        s_chunk565[i] = NULL;
    }
    s_chunk_next = 0;
    s_linebuf_width = 0;
}

static bool tab5_display_started = false;
/* Kept because the board tasks' log output does not reliably survive the
 * USB-Serial-JTAG console once MicroPython owns it -- a black screen with a
 * happily refreshing DSI is otherwise mute about which step failed. */
static esp_err_t s_display_new_err = ESP_ERR_INVALID_STATE;
static esp_err_t s_disp_on_err = ESP_ERR_INVALID_STATE;
/* Panel refreshes, counted so the live refresh rate can be measured from the
 * REPL -- which is the only way from here to tell which DPI timing the BSP
 * actually installed (the two board revisions differ by about 10Hz). */
static volatile uint32_t s_vsync_count = 0;
/* Set when the ST7121 panel was brought up here rather than by the BSP, so
 * the teardown path knows whose handles these are. */
static bool s_display_owned_locally = false;
static esp_ldo_channel_handle_t s_dsi_phy_pwr_chan = NULL;
static bsp_lcd_handles_t tab5_lcd_handles;

/* Rotate a composed landscape strip onto a portrait panel framebuffer.
 *
 * Tulip's (x, y) maps to panel (y, W-1-x), which is a 90 degree counter-
 * clockwise rotation -- exactly PPA_SRM_ROTATION_ANGLE_90.
 *
 * `y_start`/`rows` say where the strip belongs. After a 90 CCW rotation the
 * strip lands as a vertical column of the panel, at panel x == y_start, so the
 * destination block offset is on x, not y. */
static bool IRAM_ATTR tab5_ppa_trans_done(ppa_client_handle_t client, ppa_event_data_t *edata, void *user)
{
    (void)edata; (void)user;
    /* An abandoned client finishing late must not wake the current wait. */
    if (client != s_ppa_srm) {
        return false;
    }
    BaseType_t woken = pdFALSE;
    xSemaphoreGiveFromISR(s_ppa_done_sem, &woken);
    return woken == pdTRUE;
}

/* Register a PPA scale-rotate-mirror client with its completion callback.
 * Leaves s_ppa_srm NULL, and rotation on the CPU, if either step fails. */
static void tab5_ppa_client_open(void)
{
    const ppa_client_config_t ppa_cfg = {
        .oper_type = PPA_OPERATION_SRM,
        .max_pending_trans_num = 1,
    };
    ppa_client_handle_t client = NULL;
    if (ppa_register_client(&ppa_cfg, &client) != ESP_OK) {
        s_ppa_srm = NULL;
        ESP_LOGW(TAG, "PPA unavailable; rotation will run on the CPU");
        return;
    }
    if (s_ppa_done_sem == NULL) {
        s_ppa_done_sem = xSemaphoreCreateBinary();
    }
    const ppa_event_callbacks_t ppa_cbs = { .on_trans_done = tab5_ppa_trans_done };
    if (s_ppa_done_sem == NULL || ppa_client_register_event_callbacks(client, &ppa_cbs) != ESP_OK) {
        ESP_LOGW(TAG, "PPA completion callback unavailable; rotation will run on the CPU");
        ppa_unregister_client(client);
        s_ppa_srm = NULL;
        return;
    }
    s_ppa_srm = client;
}

/* Hand one composed strip to the PPA and return without waiting for it, so the
 * caller can compose the next strip while this one rotates. Collect it with
 * tab5_ppa_flush(). Returns false if the PPA is unavailable or the transaction
 * was refused, so the caller can fall back to the CPU path. */
static bool tab5_ppa_issue(const uint16_t *src, void *dst_fb, int y_start, int rows)
{
    if (s_ppa_srm == NULL || dst_fb == NULL || s_ppa_done_sem == NULL || src == NULL) {
        return false;
    }
    /* A transaction that timed out earlier may have completed since; its
     * give must not count for this one. */
    xSemaphoreTake(s_ppa_done_sem, 0);
    s_ppa_last_y = y_start;
    s_ppa_last_rows = rows;

    /* The strip is the whole picture as far as the PPA is concerned: it starts
     * at row 0 of the chunk buffer, and where it belongs on the panel is
     * carried entirely by out.block_offset_x. */
    const ppa_srm_oper_config_t srm = {
        .in = {
            .buffer = (void *)src,
            .pic_w = (uint32_t)s_provider_width,
            .pic_h = (uint32_t)rows,
            .block_w = (uint32_t)s_provider_width,
            .block_h = (uint32_t)rows,
            .block_offset_x = 0,
            .block_offset_y = 0,
            .srm_cm = PPA_SRM_COLOR_MODE_RGB565,
        },
        .out = {
            .buffer = dst_fb,
            .buffer_size = (uint32_t)BSP_LCD_H_RES * BSP_LCD_V_RES * sizeof(uint16_t),
            .pic_w = BSP_LCD_H_RES,
            .pic_h = BSP_LCD_V_RES,
            .block_offset_x = (uint32_t)y_start,
            .block_offset_y = 0,
            .srm_cm = PPA_SRM_COLOR_MODE_RGB565,
        },
        .rotation_angle = PPA_SRM_ROTATION_ANGLE_90,
        .scale_x = 1.0f,
        .scale_y = 1.0f,
        .mode = PPA_TRANS_MODE_NON_BLOCKING,
    };

    const esp_err_t err = ppa_do_scale_rotate_mirror(s_ppa_srm, &srm);
    if (err != ESP_OK) {
        /* Also where a timed-out transaction lands us afterwards: the client
         * allows one pending transaction, and the stuck one still holds it. */
        s_ppa_failures++;
        s_ppa_last_err = (int)err;
        if (s_ppa_failures == 1) {
            ESP_LOGE(TAG, "PPA rotate failed (%s); falling back to CPU rotation",
                     esp_err_to_name(err));
        }
        return false;
    }
    s_ppa_pending = true;
    s_pending_src = src;
    s_pending_fb = dst_fb;
    s_pending_y = y_start;
    s_pending_rows = rows;
    return true;
}

/* Wait for the strip in flight, if there is one. Returns false if it never
 * arrived, in which case the caller rotates s_pending_* on the CPU -- the
 * chunk buffer still holds that strip, which is why the pending one is
 * remembered at all. */
static bool tab5_ppa_flush(void)
{
    if (!s_ppa_pending) {
        return true;
    }
    s_ppa_pending = false;
    if (xSemaphoreTake(s_ppa_done_sem, pdMS_TO_TICKS(TAB5_PPA_TIMEOUT_MS)) == pdTRUE) {
        return true;
    }
    s_ppa_timeouts++;
    if (s_ppa_stuck_y < 0) {
        s_ppa_stuck_y = s_pending_y;
        s_ppa_stuck_rows = s_pending_rows;
    }
    if (s_ppa_recoveries < TAB5_PPA_MAX_RECOVERIES) {
        s_ppa_recoveries++;
        ESP_LOGE(TAG, "PPA rotate did not complete within %d ms (band y=%d rows=%d); "
                 "opening a new PPA client (%u of %d)", TAB5_PPA_TIMEOUT_MS, s_pending_y,
                 s_pending_rows, (unsigned)s_ppa_recoveries, TAB5_PPA_MAX_RECOVERIES);
        s_ppa_srm = NULL; /* abandoned, see TAB5_PPA_MAX_RECOVERIES */
        tab5_ppa_client_open();
    } else {
        ESP_LOGE(TAG, "PPA rotate did not complete within %d ms again; "
                 "rotation stays on the CPU from here", TAB5_PPA_TIMEOUT_MS);
        s_ppa_srm = NULL;
    }
    return false;
}

/* CPU fallback for the rotation: the PPA could not be registered, or one of
 * its transactions never completed (see TAB5_PPA_TIMEOUT_MS). */
/* Rotate one composed strip onto the panel, 32 source columns at a time so
 * that both the reads (one strip row segment per x) and the writes (a run of
 * consecutive panel pixels) stay in cache. The pixel-at-a-time version this
 * replaces wrote every pixel to a different cache line and took 100 ms for a
 * full frame; this does a full frame in a third of that. Still the fallback:
 * the PPA does the same without touching the CPU. */
static void tab5_cpu_rotate_chunk(uint16_t *dst_fb, const uint16_t *src, int y_start, int rows)
{
    if (dst_fb == NULL || src == NULL) {
        return;
    }
    const int W = s_provider_width;
    for (int bx = 0; bx < W; bx += 32) {
        const int xe = (bx + 32 < W) ? bx + 32 : W;
        for (int x = bx; x < xe; x++) {
            uint16_t *drow = dst_fb + (size_t)(W - 1 - x) * BSP_LCD_H_RES + y_start;
            const uint16_t *s = src + x;
            for (int r = 0; r < rows; r++) {
                *drow++ = *s;
                s += W;
            }
        }
    }
}

static void tab5_render_bridge_tick_native(void)
{
    if (!tab5_render_bridge_buffers_init()) {
        return;
    }

    for (int y = 0; y < BSP_LCD_V_RES; y += TAB5_BRIDGE_CHUNK_ROWS) {
        const int rows = (y + TAB5_BRIDGE_CHUNK_ROWS <= BSP_LCD_V_RES) ? TAB5_BRIDGE_CHUNK_ROWS : (BSP_LCD_V_RES - y);
        const int pixels = BSP_LCD_H_RES * rows;
        if (!s_render_bounce_empty(s_chunk565[0], y * BSP_LCD_H_RES, pixels * (int)sizeof(uint16_t), NULL)) {
            ESP_LOGW(TAG, "render bounce callback returned false at y=%d", y);
            s_native_callback_failures++;
            if (s_shared_provider_active) {
                tab5_use_scaffold_provider("native callback returned false");
            }
            break;
        }

        esp_lcd_panel_draw_bitmap(tab5_lcd_handles.panel, 0, y, BSP_LCD_H_RES, y + rows, s_chunk565[0]);
    }

    (void)s_render_frame_done();
    s_bridge_frames++;
}

/* Compose [y0, y1) a strip at a time, handing each strip to the PPA as soon as
 * it is composed and collecting the previous one just before the next is
 * issued -- so strip i is composed while strip i-1 is still rotating.
 * Compositing a strip costs a fraction of rotating one, so it disappears into
 * the rotation almost entirely: what used to be a serial composite, then copy,
 * then rotate is now paced by the rotation alone.
 *
 * Returns false if the compositor gave up. Whatever is in flight still has to
 * be collected by the caller in that case. */
/* Set when a frame actually handed a buffer to the panel, so the loop knows
 * whether it has already paced itself. */
static bool s_presented_this_frame = false;

/* Block until the panel begins its next refresh.
 *
 * The DSI driver switches framebuffers by assigning cur_fb_index and doing
 * nothing else -- see the "draw buffer is in frame buffer memory range" path in
 * esp_lcd_panel_dpi.c, which write-backs the cache and then just sets the
 * index. There is no wait, and no deferral to the blanking interval. So a
 * present issued at an arbitrary moment splits the screen between the two
 * buffers at whatever line the scan-out had reached, and with a scrolling plane
 * the half still coming from the other buffer is a frame of scroll out of
 * place: a band of stale content, in a different place every frame. That was
 * always true here, but at ~10 fps it happened ten times a second and at nearly
 * 30 it is constant, which is how it turned into a visible fault.
 *
 * The semaphore is drained before waiting because it is binary: a refresh that
 * completed while we were compositing would otherwise satisfy this
 * immediately, which is precisely the unsynchronised case again. The timeout
 * is the usual insurance -- a panel that stops interrupting must not take the
 * display task with it. */
static uint32_t tab5_wait_vsync(void)
{
    if (s_vsync_sem == NULL) {
        vTaskDelay(pdMS_TO_TICKS(16));
        return 0;
    }
    const int64_t t0 = esp_timer_get_time();
    s_phase = TAB5_PHASE_WAIT_VSYNC;
    xSemaphoreTake(s_vsync_sem, 0);                  /* drop a stale edge */
    xSemaphoreTake(s_vsync_sem, pdMS_TO_TICKS(100)); /* wait for a real one */
    return (uint32_t)(esp_timer_get_time() - t0);
}

static bool tab5_render_run(void *target_fb, int y0, int y1)
{
    /* Whole strips only. A run that starts or ends mid-strip issues a short
     * rotation, and a short strip leaves the PPA writing a very narrow column
     * of the panel -- a 6-row strip is 6 pixels wide, 12 bytes per output row.
     * Those are the transactions that were seen to never signal completion:
     * the first rotation to time out was stuck_rows=6, in a frame whose other
     * strips were all 12 rows. Rounding the run out to strip boundaries costs
     * a few rows of compositing and makes every transaction the same shape.
     * V_RES is a multiple of the strip height, so this makes every strip
     * exactly TAB5_BRIDGE_CHUNK_ROWS tall. */
    y0 -= y0 % TAB5_BRIDGE_CHUNK_ROWS;
    y1 = ((y1 + TAB5_BRIDGE_CHUNK_ROWS - 1) / TAB5_BRIDGE_CHUNK_ROWS) * TAB5_BRIDGE_CHUNK_ROWS;
    if (y0 < 0) y0 = 0;
    if (y1 > s_provider_height) y1 = s_provider_height;
    s_band_rows += (uint32_t)(y1 - y0);

    for (int y = y0; y < y1; y += TAB5_BRIDGE_CHUNK_ROWS) {
        const int rows = (y + TAB5_BRIDGE_CHUNK_ROWS <= y1) ? TAB5_BRIDGE_CHUNK_ROWS : (y1 - y);
        const int pixels = s_provider_width * rows;
        uint16_t *chunk = s_chunk565[s_chunk_next];

        const int64_t t0 = esp_timer_get_time();
        s_phase = TAB5_PHASE_COMPOSITE;
        if (!s_render_bounce_empty(chunk, y * s_provider_width, pixels * (int)sizeof(uint16_t), NULL)) {
            ESP_LOGW(TAG, "render bounce callback returned false at src y=%d", y);
            s_rotated_callback_failures++;
            if (s_shared_provider_active) {
                tab5_use_scaffold_provider("rotated callback returned false");
            }
            return false;
        }
        const int64_t t1 = esp_timer_get_time();
        s_acc_composite += (uint32_t)(t1 - t0);

        /* Collect the strip issued last time round before handing the engine
         * another: the client allows one transaction in flight. This is the
         * only place a frame blocks, and only for whatever is left of the
         * previous rotation once this strip's compositing has been paid out of
         * it. */
        s_phase = TAB5_PHASE_ROTATE;
        if (!tab5_ppa_flush()) {
            tab5_cpu_rotate_chunk((uint16_t *)s_pending_fb, s_pending_src, s_pending_y, s_pending_rows);
        }
        const int64_t t2 = esp_timer_get_time();
        s_acc_convert += (uint32_t)(t2 - t1);

