MinoruInachi/tulipcc/tulip/esp32p4/boards/TAB5/display_tab5.c
        if (target_fb != NULL && !tab5_ppa_issue(chunk, target_fb, y, rows)) {
            tab5_cpu_rotate_chunk((uint16_t *)target_fb, chunk, y, rows);
            s_acc_rotate += (uint32_t)(esp_timer_get_time() - t2);
        } else if (s_chunk565[1] == NULL) {
            /* Nothing to ping-pong with, so there is no overlap to be had: the
             * next strip would be composed over the one the PPA is reading. */
            const int64_t t3 = esp_timer_get_time();
            if (!tab5_ppa_flush()) {
                tab5_cpu_rotate_chunk((uint16_t *)s_pending_fb, s_pending_src, s_pending_y, s_pending_rows);
            }
            s_acc_convert += (uint32_t)(esp_timer_get_time() - t3);
        }

        if (s_chunk565[1] != NULL) {
            s_chunk_next ^= 1u;
        }
    }
    return true;
}

static void tab5_render_bridge_tick_rotated(int band_y0, int band_y1)
{
    if (!tab5_render_bridge_buffers_init()) {
        return;
    }
    s_phase = TAB5_PHASE_COMPOSITE;

    if (s_provider_width != TAB5_SHARED_RENDER_W || s_provider_height != TAB5_SHARED_RENDER_H) {
        ESP_LOGW(TAG, "Unsupported provider geometry %dx%d", s_provider_width, s_provider_height);
        if (s_shared_provider_active) {
            tab5_use_scaffold_provider("unsupported shared provider geometry");
        }
        return;
    }

    /* With two DSI framebuffers we compose into the one that is not on screen
     * and hand it over with a pointer swap; with one we have no choice but to
     * write the live buffer. */
    void *target_fb = (s_dsi_fb_count > 1) ? s_dsi_fb[s_dsi_fb_next] : s_dsi_fb[0];

    if (band_y0 < 0) band_y0 = 0;
    if (band_y1 > s_provider_height) band_y1 = s_provider_height;
    if (band_y1 <= band_y0) {
        return;
    }

    /* The framebuffer that is not on screen is a frame behind, so it also needs
     * the rows the previous frame changed, or a partial update resurrects stale
     * pixels every time the two alternate. Those rows are composed again rather
     * than re-read from a staging image, because there is no staging image any
     * more; compositing a row costs a fraction of rotating it, and the rotation
     * was always the real price of the catch-up. Keeping the two runs apart
     * rather than unioning them is still the point -- a safety slice at the top
     * of the screen and a beat LED at the bottom used to redraw everything in
     * between. */
    int prev_y0 = 0;
    int prev_y1 = 0;
    if (s_dsi_fb_count > 1) {
        prev_y0 = s_prev_band_y0;
        prev_y1 = s_prev_band_y1;
        s_prev_band_y0 = band_y0;
        s_prev_band_y1 = band_y1;
        if (prev_y0 < 0) prev_y0 = 0;
        if (prev_y1 > s_provider_height) prev_y1 = s_provider_height;
        /* Touching or overlapping runs cost less as one run than two. */
        if (prev_y1 > prev_y0 && prev_y0 <= band_y1 && prev_y1 >= band_y0) {
            if (prev_y0 < band_y0) band_y0 = prev_y0;
            if (prev_y1 > band_y1) band_y1 = prev_y1;
            prev_y0 = prev_y1 = 0;
        }
    }
    /* Accumulated by the runs below, which round out to whole strips: what got
     * composed is a few rows more than what was reported damaged. */
    s_band_rows = 0;

    s_acc_composite = 0;
    s_acc_convert = 0;
    s_acc_rotate = 0;

    if (tab5_render_run(target_fb, band_y0, band_y1) && prev_y1 > prev_y0) {
        (void)tab5_render_run(target_fb, prev_y0, prev_y1);
    }

    /* Nothing may present, or reuse a chunk buffer, while a rotation is still
     * reading one. */
    const int64_t t_flush = esp_timer_get_time();
    s_phase = TAB5_PHASE_ROTATE;
    if (!tab5_ppa_flush()) {
        tab5_cpu_rotate_chunk((uint16_t *)s_pending_fb, s_pending_src, s_pending_y, s_pending_rows);
    }
    s_acc_convert += (uint32_t)(esp_timer_get_time() - t_flush);

    if (target_fb != NULL) {
        /* Hand the finished buffer over at a frame boundary rather than
         * mid-scan; see tab5_wait_vsync. With a single framebuffer there is no
         * swap to time -- the rotation wrote the buffer the panel is already
         * showing -- so waiting would cost a refresh and buy nothing. */
        if (s_dsi_fb_count > 1) {
            s_us_wait = tab5_wait_vsync();
        }
        const int64_t t_pres = esp_timer_get_time();
        s_phase = TAB5_PHASE_PRESENT;
        /* The buffer already lives inside the panel's framebuffer set, so this
         * is a cache write-back plus a framebuffer index switch -- no copy. */
        esp_lcd_panel_draw_bitmap(tab5_lcd_handles.panel, 0, 0, BSP_LCD_H_RES, BSP_LCD_V_RES, target_fb);
        s_us_present = (uint32_t)(esp_timer_get_time() - t_pres);
        s_presented_this_frame = true;
        if (s_dsi_fb_count > 1) {
            s_dsi_fb_next ^= 1u;
        }
    }

    /* Publish the finished frame's figures in one go; see s_acc_*. */
    s_us_composite = s_acc_composite;
    s_us_convert = s_acc_convert;
    s_us_rotate = s_acc_rotate;

    s_phase = TAB5_PHASE_FRAME_DONE;
    (void)s_render_frame_done();
    s_bridge_frames++;
}

static void tab5_render_bridge_tick_rows(int y0, int y1)
{
    if (s_provider_width == BSP_LCD_H_RES && s_provider_height == BSP_LCD_V_RES) {
        tab5_render_bridge_tick_native();
        return;
    }

    tab5_render_bridge_tick_rotated(y0, y1);
}

static bool tab5_on_refresh_done(esp_lcd_panel_handle_t panel,
                                 esp_lcd_dpi_panel_event_data_t *edata,
                                 void *user_ctx)
{
    (void)panel;
    (void)edata;
    (void)user_ctx;
    s_vsync_count++;
    BaseType_t higher_priority_woken = pdFALSE;
    xSemaphoreGiveFromISR(s_vsync_sem, &higher_priority_woken);
    return higher_priority_woken == pdTRUE;
}

/* The BSP knows the ILI9881C and the ST7123, but Tab5 units built from
 * 2026-04-28 carry an ST7121 that it has no path for -- and the ST7123 path
 * leaves that panel lit and blank, because its unlock command carries the
 * controller's own part number and an ST7121 quietly ignores an ST7123's. So
 * this panel gets brought up here, with the numbers M5's own BSP uses for it:
 * a slower DSI lane rate than the ST7123 wants and a different vertical
 * blanking. Everything either panel needs afterwards is identical, so only the
 * creation differs. */
/* M5's own firmware runs both ST712x panels at this rate; the BSP's 1000 is
 * the number for the v1 panel it was written against. */
#define TAB5_ST712X_LANE_BITRATE_MBPS 965
#define TAB5_ST7121_DPI_CLOCK_MHZ 70
/* DCS sleep-out, and the settle the datasheet asks for after it. */
#define TAB5_LCD_CMD_SLPOUT 0x11
#define TAB5_SLPOUT_SETTLE_MS 120

static esp_err_t tab5_display_new_st7121(bsp_lcd_handles_t *out)
{
    ESP_RETURN_ON_ERROR(bsp_feature_enable(BSP_FEATURE_LCD, true), TAG, "LCD power failed");
    ESP_RETURN_ON_ERROR(bsp_display_brightness_init(), TAG, "Brightness init failed");

    if (s_dsi_phy_pwr_chan == NULL) {
        const esp_ldo_channel_config_t ldo_cfg = {
            .chan_id = BSP_MIPI_DSI_PHY_PWR_LDO_CHAN,
            .voltage_mv = BSP_MIPI_DSI_PHY_PWR_LDO_VOLTAGE_MV,
        };
        ESP_RETURN_ON_ERROR(esp_ldo_acquire_channel(&ldo_cfg, &s_dsi_phy_pwr_chan), TAG,
                            "DSI PHY power failed");
    }

    const esp_lcd_dsi_bus_config_t bus_config = {
        .bus_id = 0,
        .num_data_lanes = BSP_LCD_MIPI_DSI_LANE_NUM,
        .phy_clk_src = MIPI_DSI_PHY_CLK_SRC_DEFAULT,
        .lane_bit_rate_mbps = TAB5_ST712X_LANE_BITRATE_MBPS,
    };
    ESP_RETURN_ON_ERROR(esp_lcd_new_dsi_bus(&bus_config, &out->mipi_dsi_bus), TAG,
                        "New DSI bus failed");

    const esp_lcd_dbi_io_config_t dbi_config = {
        .virtual_channel = 0,
        .lcd_cmd_bits = 8,
        .lcd_param_bits = 8,
    };
    ESP_RETURN_ON_ERROR(esp_lcd_new_panel_io_dbi(out->mipi_dsi_bus, &dbi_config, &out->io), TAG,
                        "New panel IO failed");

    const esp_lcd_dpi_panel_config_t dpi_config = {
        .virtual_channel = 0,
        .dpi_clk_src = MIPI_DSI_DPI_CLK_SRC_DEFAULT,
        .dpi_clock_freq_mhz = TAB5_ST7121_DPI_CLOCK_MHZ,
        .in_color_format = LCD_COLOR_FMT_RGB565,
        .num_fbs = CONFIG_BSP_LCD_DPI_BUFFER_NUMS,
        .video_timing = {
            .h_size = BSP_LCD_H_RES,
            .v_size = BSP_LCD_V_RES,
            .hsync_pulse_width = 2,
            .hsync_back_porch = 40,
            .hsync_front_porch = 40,
            .vsync_pulse_width = 20,
            .vsync_back_porch = 24,
            .vsync_front_porch = 200,
        },
#if CONFIG_BSP_LCD_USE_DMA2D && (ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(6, 0, 0))
        .flags.use_dma2d = true,
#endif
    };

    /* NULL init_cmds means the driver's own sequence, which is the one written
     * for this panel. */
    const st7121_vendor_config_t vendor_config = {
        .init_cmds = NULL,
        .init_cmds_size = 0,
        .mipi_config = {
            .dsi_bus = out->mipi_dsi_bus,
            .dpi_config = &dpi_config,
        },
    };
    const esp_lcd_panel_dev_config_t panel_config = {
        .reset_gpio_num = BSP_LCD_RST,   /* not wired: the driver software-resets */
        .rgb_ele_order = BSP_LCD_COLOR_SPACE,
        .bits_per_pixel = BSP_LCD_BITS_PER_PIXEL,
        .vendor_config = (void *)&vendor_config,
    };
    ESP_RETURN_ON_ERROR(esp_lcd_new_panel_st7121(out->io, &panel_config, &out->panel), TAG,
                        "New ST7121 panel failed");
    ESP_RETURN_ON_ERROR(esp_lcd_panel_reset(out->panel), TAG, "Panel reset failed");
    ESP_RETURN_ON_ERROR(esp_lcd_panel_init(out->panel), TAG, "Panel init failed");

    ESP_LOGI(TAG, "ST7121 display initialized with resolution %dx%d",
             BSP_LCD_H_RES, BSP_LCD_V_RES);
    return ESP_OK;
}

