MinoruInachi/tulipcc/tulip/esp32p4/boards/TAB5/display_tab5.c
void tab5_display_start(void)
{
    if (tab5_display_started) {
        return;
    }

    const tab5_board_revision_t rev = tab5_detect_board_revision();
    const bsp_display_config_t cfg = {
        .dsi_bus = {
            .phy_clk_src = 0,
            .lane_bit_rate_mbps = (rev == TAB5_REV_V2_ST7123)
                                      ? TAB5_ST712X_LANE_BITRATE_MBPS
                                      : BSP_LCD_MIPI_DSI_LANE_BITRATE_MBPS,
        }
    };

    memset(&tab5_lcd_handles, 0, sizeof(tab5_lcd_handles));
    s_display_owned_locally = (rev == TAB5_REV_V2_ST7121);
    s_display_new_err = s_display_owned_locally
                            ? tab5_display_new_st7121(&tab5_lcd_handles)
                            : bsp_display_new_with_handles(&cfg, &tab5_lcd_handles);
    if (s_display_new_err != ESP_OK) {
        ESP_LOGE(TAG, "Tab5 display start failed: %s", esp_err_to_name(s_display_new_err));
        return;
    }

    if (rev == TAB5_REV_V2_ST7123 && tab5_lcd_handles.io != NULL) {
        /* The BSP's ST7123 table sends SLPOUT with no settle time and DISPON
         * straight after it, where M5's copy of the same table waits 100ms and
         * the panel driver's own default waits 120. A panel told to turn its
         * display on while it is still waking is exactly the failure this port
         * spent a day on, so give it that time. SLPOUT on an already-awake
         * panel is a no-op, and the cost is 120ms of boot on a v2 board.
         *
         * Untested: there is no ST7123 unit here, only the ST7121 that
         * replaced it in Tab5 units built from 2026-04-28. */
        esp_lcd_panel_io_tx_param(tab5_lcd_handles.io, TAB5_LCD_CMD_SLPOUT, NULL, 0);
        vTaskDelay(pdMS_TO_TICKS(TAB5_SLPOUT_SETTLE_MS));
    }

    s_disp_on_err = esp_lcd_panel_disp_on_off(tab5_lcd_handles.panel, true);

    if (s_vsync_sem == NULL) {
        s_vsync_sem = xSemaphoreCreateBinary();
    }
    if (s_vsync_sem != NULL) {
        const esp_lcd_dpi_panel_event_callbacks_t cbs = {
            .on_refresh_done = tab5_on_refresh_done,
        };
        if (esp_lcd_dpi_panel_register_event_callbacks(tab5_lcd_handles.panel, &cbs, NULL) != ESP_OK) {
            ESP_LOGW(TAG, "No panel refresh callback; falling back to timed pacing");
            vSemaphoreDelete(s_vsync_sem);
            s_vsync_sem = NULL;
        }
    }

    /* The vendor panel drivers hand back the DPI panel handle itself, so the
     * DSI framebuffers can be claimed directly and composed into in place. */
    s_dsi_fb_count = 0;
    if (esp_lcd_dpi_panel_get_frame_buffer(tab5_lcd_handles.panel, 2,
                                           &s_dsi_fb[0], &s_dsi_fb[1]) == ESP_OK) {
        s_dsi_fb_count = 2;
    } else if (esp_lcd_dpi_panel_get_frame_buffer(tab5_lcd_handles.panel, 1,
                                                  &s_dsi_fb[0]) == ESP_OK) {
        s_dsi_fb[1] = NULL;
        s_dsi_fb_count = 1;
        ESP_LOGW(TAG, "Only one DSI frame buffer; expect tearing "
                      "(raise CONFIG_BSP_LCD_DPI_BUFFER_NUMS to 2)");
    } else {
        ESP_LOGE(TAG, "Could not obtain any DSI frame buffer");
    }
    s_dsi_fb_next = (s_dsi_fb_count > 1) ? 1u : 0u;

    tab5_ppa_client_open();

    bsp_display_backlight_on();
    brightness = 5;
    tab5_display_brightness(brightness);
    tab5_display_started = true;
    ESP_LOGI(TAG, "Tab5 display initialized (fbs=%u, rotation=%s)",
             (unsigned)s_dsi_fb_count, s_ppa_srm ? "PPA" : "CPU");
}

void tab5_display_stop(void)
{
    if (!tab5_display_started) {
        return;
    }

    if (s_ppa_srm != NULL) {
        ppa_unregister_client(s_ppa_srm);
        s_ppa_srm = NULL;
    }
    if (s_display_owned_locally) {
        if (tab5_lcd_handles.panel != NULL) {
            esp_lcd_panel_del(tab5_lcd_handles.panel);
        }
        if (tab5_lcd_handles.io != NULL) {
            esp_lcd_panel_io_del(tab5_lcd_handles.io);
        }
        if (tab5_lcd_handles.mipi_dsi_bus != NULL) {
            esp_lcd_del_dsi_bus(tab5_lcd_handles.mipi_dsi_bus);
        }
        s_display_owned_locally = false;
    } else {
        bsp_display_delete();
    }
    tab5_render_bridge_buffers_deinit();
    s_dsi_fb[0] = NULL;
    s_dsi_fb[1] = NULL;
    s_dsi_fb_count = 0;
    s_dsi_fb_next = 0;
    memset(&tab5_lcd_handles, 0, sizeof(tab5_lcd_handles));
    tab5_display_started = false;
}

/* Raw DCS access to the panel, for working out on a live board what a panel
 * that refuses to light is actually doing -- 0x0A (RDDPM) says whether it is
 * awake and whether its display is on, which no counter here can. */
int tab5_display_panel_cmd(int cmd, const unsigned char *data, unsigned int len)
{
    if (tab5_lcd_handles.io == NULL) {
        return (int)ESP_ERR_INVALID_STATE;
    }
    return (int)esp_lcd_panel_io_tx_param(tab5_lcd_handles.io, cmd,
                                          (len > 0) ? data : NULL, len);
}

int tab5_display_panel_read(int cmd, unsigned char *out, unsigned int len)
{
    if (tab5_lcd_handles.io == NULL) {
        return (int)ESP_ERR_INVALID_STATE;
    }
    return (int)esp_lcd_panel_io_rx_param(tab5_lcd_handles.io, cmd, out, len);
}

uint32_t tab5_display_vsync_count(void)
{
    return s_vsync_count;
}

void tab5_display_init_errors(int *new_err, int *on_err)
{
    if (new_err != NULL) {
        *new_err = (int)s_display_new_err;
    }
    if (on_err != NULL) {
        *on_err = (int)s_disp_on_err;
    }
}

void tab5_display_brightness(unsigned char amount)
{
    /* Tulip uses a 1-9 scale today; map that onto the BSP 0-100 brightness range. */
    uint8_t percent = 0;
    if (amount > 0) {
        percent = (uint8_t)(amount * 11);
        if (percent > 100) {
            percent = 100;
        }
    }
    bsp_display_brightness_set(percent);
}

void run_tab5_display(void *arg)
{
    (void)arg;
    s_display_task_entries++;

    tab5_board_revision_t rev = tab5_detect_board_revision();
    ESP_LOGI(TAG, "Display startup on %s", tab5_board_revision_name(rev));

    tab5_display_start();
    if (!tab5_display_started) {
        ESP_LOGE(TAG, "Display task exiting because display start failed");
        vTaskDelete(NULL);
        return;
    }

    /* Has to happen on this task: the PIE registers are saved per pinned task,
     * so the self-test must run where the blending will. */
    tab5_pie_init();
    ESP_LOGI(TAG, "PIE vector blend %s", tab5_pie_ok() ? "enabled" : "DISABLED (self-test failed)");

    if (!s_tulip_shared_renderer_initialized) {
        display_init();
        display_tfb_set_default_bg_color(TAB5_REPL_TRANSPARENT_BG);
        tab5_clear_boot_background();
        s_tulip_shared_renderer_initialized = true;
        ESP_LOGI(TAG, "Initialized Tulip shared renderer state");
    }

