MinoruInachi/tulipcc/tulip/esp32p4/boards/TAB5/display_tab5.c
    if (TAB5_FORCE_ROTATED_PROVIDER_TEST) {
        tab5_set_render_provider_with_geometry(tab5_scaffold_bounce_empty,
                                               tab5_scaffold_frame_done,
                                               TAB5_SHARED_RENDER_W,
                                               TAB5_SHARED_RENDER_H);
        s_shared_provider_active = false;
        ESP_LOGW(TAG, "Tab5 rotated provider self-test is enabled (%dx%d)",
                 TAB5_SHARED_RENDER_W,
                 TAB5_SHARED_RENDER_H);
    } else {
        ESP_LOGI(TAG,
                 "Shared provider symbols detected: bounce=%p frame_done=%p",
                 (void *)(uintptr_t)display_bounce_empty,
                 (void *)(uintptr_t)display_frame_done_generic);
        tab5_set_render_provider_with_geometry(display_bounce_empty,
                                               display_frame_done_generic,
                                               TAB5_SHARED_RENDER_W,
                                               TAB5_SHARED_RENDER_H);
        s_shared_provider_active = true;
        ESP_LOGI(TAG, "Tab5 display using shared Tulip render provider (%dx%d)",
                 TAB5_SHARED_RENDER_W,
                 TAB5_SHARED_RENDER_H);
    }

    if (!tab5_render_bridge_buffers_init()) {
        ESP_LOGE(TAG, "Display task exiting because bridge buffers are unavailable");
        vTaskDelete(NULL);
        return;
    }

    ESP_LOGI(TAG, "Tab5 display task is running (Tulip render bridge mode)");
    uint32_t frames_since_forced = 0;
    int forced_slice = 0;
    while (1) {
        const int64_t busy_start_us = esp_timer_get_time();
        s_presented_this_frame = false;

        /* Recompose only when something said it changed. At the REPL nothing
         * does, and skipping frees the memory bandwidth that audio needs. */
        frames_since_forced++;
        int band_y0 = 0;
        int band_y1 = TAB5_SHARED_RENDER_H;
        const bool have_damage = display_take_dirty_rows(&band_y0, &band_y1);
        /* Periodic safety redraw, one slice of the screen per turn. It waits
         * for a frame with no damage of its own, because merging a slice with a
         * band at the other end of the screen redraws everything in between --
         * which is the whole-frame cost this is here to avoid. The counter
         * resets only when a slice is actually drawn, so a busy screen delays
         * the net rather than postponing it forever (which is what resetting on
         * every band redraw used to do); past TAB5_FORCED_SLICE_MAX_FRAMES it
         * merges anyway and accepts the one wide frame. */
        bool forced = false;
        if (frames_since_forced >= TAB5_FORCED_SLICE_FRAMES &&
            (!have_damage || frames_since_forced >= TAB5_FORCED_SLICE_MAX_FRAMES)) {
            const int slice_y0 = forced_slice * TAB5_FORCED_SLICE_ROWS;
            int slice_y1 = slice_y0 + TAB5_FORCED_SLICE_ROWS;
            if (slice_y1 > TAB5_SHARED_RENDER_H) slice_y1 = TAB5_SHARED_RENDER_H;
            if (have_damage) {
                if (slice_y0 < band_y0) band_y0 = slice_y0;
                if (slice_y1 > band_y1) band_y1 = slice_y1;
            } else {
                band_y0 = slice_y0;
                band_y1 = slice_y1;
            }
            forced_slice = (forced_slice + 1) % TAB5_FORCED_SLICES;
            frames_since_forced = 0;
            forced = true;
        }
        if (have_damage || forced) {
            tab5_render_bridge_tick_rows(band_y0, band_y1);
        } else {
            s_frames_skipped++;
            /* Still run the end-of-frame hook. It drives tulip_frame_isr(),
             * which is what schedules lv_task_handler() and the Python frame
             * callback -- skipping it would stall the UI instead of idling it,
             * and LVGL would never get the chance to mark anything dirty. */
            (void)s_render_frame_done();
        }
        const int64_t busy_us = esp_timer_get_time() - busy_start_us;
        s_window_busy_us += busy_us;
        tab5_bridge_update_stats();
        if (busy_us > TAB5_FRAME_YIELD_US) {
            vTaskDelay(1);
        }

        /* Pace to the panel. A frame that presented already waited for a
         * refresh boundary immediately before handing the buffer over, so
         * waiting again here would park it for a second refresh and halve the
         * rate; only a frame that drew nothing still needs pacing. The flag is
         * what says which, rather than "did we have damage": the tick can
         * return without presenting (unsupported geometry, an empty band), and
         * spinning on those would be a busy loop. */
        if (!s_presented_this_frame) {
            const int64_t wait_start_us = esp_timer_get_time();
            s_phase = TAB5_PHASE_WAIT_VSYNC;
            if (s_vsync_sem != NULL) {
                xSemaphoreTake(s_vsync_sem, pdMS_TO_TICKS(100));
            } else {
                vTaskDelay(pdMS_TO_TICKS(33));
            }
            s_us_wait = (uint32_t)(esp_timer_get_time() - wait_start_us);
        }
    }
}

uint32_t tab5_display_task_entries(void)
{
    return s_display_task_entries;
}

uint32_t tab5_display_bridge_frames(void)
{
    return s_bridge_frames;
}

void tab5_display_render_stats(tab5_render_stats_t *out)
{
    if (out == NULL) {
        return;
    }
    out->composite_us = s_us_composite;
    out->convert_us = s_us_convert;
    out->rotate_us = s_us_rotate;
    out->present_us = s_us_present;
    out->wait_us = s_us_wait;
    out->frames_skipped = s_frames_skipped;
    out->band_rows = s_band_rows;
    out->ppa_failures = s_ppa_failures;
    out->ppa_timeouts = s_ppa_timeouts;
    out->phase = s_phase;
    out->ppa_last_err = s_ppa_last_err;
    out->ppa_recoveries = s_ppa_recoveries;
    out->ppa_stuck_y = s_ppa_stuck_y;
    out->ppa_stuck_rows = s_ppa_stuck_rows;
    out->ppa_last_y = s_ppa_last_y;
    out->ppa_last_rows = s_ppa_last_rows;
    out->dsi_fb_count = s_dsi_fb_count;
    out->ppa_active = (s_ppa_srm != NULL);
    out->vsync_paced = (s_vsync_sem != NULL);
    out->pie_active = tab5_pie_ok();
}
